import HeadHelmet from '@/components/HeadHelmet/HeadHelmet';

const TermsOfServicePage = () => {
  return (
    <>
      <HeadHelmet
        title='이용약관'
        description='이용약관'
        urlPath='/terms-of-service'
      />

      <div>
        <div>
          <p>
            본 이용약관(이하 "약관")은 본 웹서비스(이하 "서비스")를 이용하는
            사용자(이하 "회원")와 서비스 운영자(이하 "회사") 간의 권리와 의무,
            책임 사항 등을 규정합니다. 회원은 서비스를 이용함으로써 본 약관에
            동의하는 것으로 간주됩니다.
          </p>
        </div>
        <br />

        <div>
          <strong>1. 약관의 목적</strong>
          <p>
            본 약관은 회사가 제공하는 서비스의 이용과 관련하여 회사와 회원 간의
            권리, 의무, 책임 및 기타 필요한 사항을 규정하는 것을 목적으로
            합니다.
          </p>
        </div>
        <br />

        <div>
          <strong>2. 용어의 정의</strong>
          <div>
            - 서비스: 회사가 제공하는 모든 웹사이트 및 모바일 애플리케이션을
            의미합니다. - 회원: 서비스에 접속하여 본 약관에 따라 서비스를
            이용하는 개인을 의미합니다.
          </div>
          <div>
            - 계정: 회원이 서비스에 로그인하기 위해 설정한 이메일 주소 및
            비밀번호 등의 정보를 의미합니다.
          </div>
          <div>
            - 콘텐츠: 서비스 내에서 제공되는 텍스트, 이미지, 동영상 등 모든
            자료를 의미합니다.
          </div>
        </div>
        <br />

        <div>
          <strong>3. 약관의 효력 및 변경</strong>
          <div>
            - 본 약관은 회원이 서비스에 가입하여 동의함으로써 효력이 발생합니다.
          </div>
          <div>
            - 회사는 관련 법령을 위반하지 않는 범위에서 약관을 변경할 수 있으며,
            변경된 약관은 공지사항을 통해 고지합니다. 회원이 변경된 약관에
            동의하지 않는 경우, 회원은 서비스 이용을 중단하고 탈퇴할 수
            있습니다.
          </div>
        </div>
        <br />

        <div>
          <strong>4. 회원가입 및 계정 관리</strong>
          <div>
            - 회원가입은 본인이 실제 사용하는 이메일 주소를 통해 이루어지며,
            잘못된 정보 제공 시 발생하는 불이익에 대해 회사는 책임지지 않습니다.
          </div>
          <div>
            - 회원은 자신의 계정 정보의 보안을 유지해야 하며, 타인에게 양도 또는
            대여할 수 없습니다. 계정의 부정 사용으로 발생한 문제에 대한 책임은
            회원 본인에게 있습니다.
          </div>
        </div>
        <br />

        <div>
          <strong>5. 서비스 이용</strong>
          <div>
            - 회원은 본 약관과 관련 법령을 준수하여 서비스를 이용해야 하며,
            불법적이거나 부적절한 행위로 서비스에 피해를 주어서는 안 됩니다.
          </div>
          <div>
            - 회사는 서비스 제공을 위해 필요한 경우, 회원의 사전 동의 없이
            서비스의 내용을 변경하거나 일시 중단할 수 있습니다.
          </div>
        </div>
        <br />

        <div>
          <strong>6. 개인정보 보호</strong>
          <p>
            회사는 회원의 개인정보를 보호하기 위해 노력하며, 수집된 개인정보는
            관련 법령 및 [개인정보 처리방침]에 따라 처리됩니다.
          </p>
        </div>
        <br />

        <div>
          <strong>7. 콘텐츠의 소유권 및 사용권</strong>
          <div>
            - 서비스 내에서 제공되는 모든 콘텐츠의 저작권은 회사에 있으며,
            회원은 회사의 사전 허락 없이 해당 콘텐츠를 상업적 목적으로 사용,
            배포, 복제할 수 없습니다.
          </div>
          <div>
            - 회원이 서비스에 게시한 콘텐츠의 저작권은 회원에게 있으며, 회원은
            회사가 해당 콘텐츠를 서비스 운영 및 홍보 목적으로 사용하는 것을
            허락합니다.
          </div>
        </div>
        <br />

        <div>
          <strong>8. 서비스 이용 제한</strong>
          <div>
            회사는 다음과 같은 경우 회원의 서비스 이용을 제한하거나 중지할 수
            있습니다:
            <div>
              - 회원이 본 약관 또는 법령을 위반한 경우 - 서비스 운영을 고의로
              방해하거나, 부정한 목적으로 이용하는 경우
            </div>
            <div>
              - 회사의 명예를 훼손하거나 타 회원에게 피해를 주는 행위를 한 경우
              본 약관은 2024년 10월 31일부터 시행됩니다.
            </div>
          </div>
        </div>
        <br />

        <div>
          <strong>9. 책임의 제한</strong>
          <div>
            - 회사는 천재지변, 불가항력 또는 회사의 통제를 벗어난 상황에서
            발생한 서비스 중단이나 데이터 손실에 대해 책임을 지지 않습니다.
          </div>
          <div>
            - 회사는 회원이 서비스 이용 중 게재한 정보나 자료의 정확성, 신뢰성에
            대해 보증하지 않습니다.
          </div>
        </div>
        <br />

        <div>
          <strong>10. 계약 해지 및 회원 탈퇴</strong>
          <div>
            - 회원은 언제든지 서비스 내 회원 탈퇴 기능을 통해 탈퇴할 수 있으며,
            탈퇴 즉시 서비스 이용 권한이 소멸합니다.
          </div>

          <div>
            - 회사는 회원이 본 약관을 위반하거나 부정한 방법으로 서비스를 이용한
            경우, 사전 통보 없이 회원 자격을 박탈할 수 있습니다.
          </div>
        </div>
        <br />

        <div>
          <strong>11. 분쟁 해결</strong>
          <div>
            - 본 약관에 규정되지 않은 사항은 관련 법령 및 상관례에 따릅니다.{' '}
          </div>
          <div>
            - 서비스 이용 중 발생한 분쟁에 대해 회사와 회원 간의 협의로 해결하지
            못할 경우, 관련 법령에 따른 법원을 관할 법원으로 합니다.
          </div>
        </div>
        <br />

        <div>
          <strong>12. 부칙</strong>
          <p>본 약관은 2024년 10월 31일부터 시행됩니다.</p>
        </div>
        <br />
      </div>
    </>
  );
};

export default TermsOfServicePage;
